---
kind: type
id: T:Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs
source: html/a76d0414-5c2a-7af0-fac6-27689b7f5f03.htm
---
# Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs

The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpening] .

## Syntax (C#)
```csharp
public class LinkedResourceOpeningEventArgs : RevitAPIPreEventArgs
```